## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # helm_release.cert-manager-loadtesting will be created
+   resource "helm_release" "cert-manager-loadtesting" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "cert-manager"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "v1.9.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "createCustomResource"
+           value = "true"
        }
+       set {
+           name  = "installCRDs"
+           value = "true"
        }
    }

  # helm_release.external-dns-loadtesting will be created
+   resource "helm_release" "external-dns-loadtesting" {
+       atomic                     = false
+       chart                      = "external-dns"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "external-dns"
+       namespace                  = "external-dns"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.bitnami.com/bitnami"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "6.9.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "domainFilters"
+           value = "{wayofthesys.org}"
        }
+       set {
+           name  = "istio-ingress-gateway"
+           value = "istio-system/istio-ingressgateway"
        }
+       set {
+           name  = "provider"
+           value = "digitalocean"
        }
+       set {
+           name  = "rbac.create"
+           value = "true"
        }
+       set {
+           name  = "sources"
+           value = "{ingress,service,istio-gateway}"
        }

+       set_sensitive {
+           name  = "digitalocean.apiToken"
+           value = (sensitive value)
        }
    }

  # helm_release.istio-base-loadtesting will be created
+   resource "helm_release" "istio-base-loadtesting" {
+       atomic                     = false
+       chart                      = "base"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-base"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istio-egress-loadtesting will be created
+   resource "helm_release" "istio-egress-loadtesting" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-egressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "service.type"
+           value = "ClusterIP"
        }
    }

  # helm_release.istio-ingress-loadtesting will be created
+   resource "helm_release" "istio-ingress-loadtesting" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-ingressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istiod-loadtesting will be created
+   resource "helm_release" "istiod-loadtesting" {
+       atomic                     = false
+       chart                      = "istiod"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istiod"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "grafana.enabled"
+           value = "true"
        }
+       set {
+           name  = "kiali.enabled"
+           value = "true"
        }
+       set {
+           name  = "meshConfig.accessLogFile"
+           value = "/dev/stdout"
        }
+       set {
+           name  = "servicegraph.enabled"
+           value = "true"
        }
+       set {
+           name  = "tracing.enabled"
+           value = "true"
        }
    }

  # helm_release.kubed will be destroyed
  # (because helm_release.kubed is not in configuration)
-   resource "helm_release" "kubed" {
-       atomic                     = false -> null
-       chart                      = "kubed" -> null
-       cleanup_on_fail            = false -> null
-       create_namespace           = false -> null
-       dependency_update          = false -> null
-       disable_crd_hooks          = false -> null
-       disable_openapi_validation = false -> null
-       disable_webhooks           = false -> null
-       force_update               = false -> null
-       id                         = "kubed" -> null
-       lint                       = false -> null
-       max_history                = 0 -> null
-       metadata                   = [
-           {
-               app_version = "v0.13.2"
-               chart       = "kubed"
-               name        = "kubed"
-               namespace   = "kube-system"
-               revision    = 1
-               values      = jsonencode(
                    {
-                       apiserver = {
-                           enabled = false
                        }
-                       config    = {
-                           clusterName = "cinema"
                        }
                    }
                )
-               version     = "v0.13.2"
            },
        ] -> null
-       name                       = "kubed" -> null
-       namespace                  = "kube-system" -> null
-       pass_credentials           = false -> null
-       recreate_pods              = false -> null
-       render_subchart_notes      = true -> null
-       replace                    = false -> null
-       repository                 = "https://charts.appscode.com/stable/" -> null
-       reset_values               = false -> null
-       reuse_values               = false -> null
-       skip_crds                  = false -> null
-       status                     = "deployed" -> null
-       timeout                    = 120 -> null
-       verify                     = false -> null
-       version                    = "v0.13.2" -> null
-       wait                       = true -> null
-       wait_for_jobs              = false -> null

-       set {
-           name  = "apiserver.enabled" -> null
-           value = "false" -> null
        }
-       set {
-           name  = "config.clusterName" -> null
-           value = "cinema" -> null
        }
    }

  # kubernetes_namespace.cert-manager-loadtesting will be created
+   resource "kubernetes_namespace" "cert-manager-loadtesting" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.external-dns-loadtesting will be created
+   resource "kubernetes_namespace" "external-dns-loadtesting" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.istio-system-loadtesting will be created
+   resource "kubernetes_namespace" "istio-system-loadtesting" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.loadtesting will be created
+   resource "kubernetes_namespace" "loadtesting" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "istio-injection" = "enabled"
            }
+           name             = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.digital-ocean-secret-loadtesting will be created
+   resource "kubernetes_secret" "digital-ocean-secret-loadtesting" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "digital-ocean-secret"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.loadtesting_manager will be created
+   resource "kubernetes_secret" "loadtesting_manager" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/service-account-token"

+       metadata {
+           annotations      = {
+               "kubernetes.io/service-account.name" = "loadtesting-manager"
            }
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.wayofthesys-tls-loadtesting will be created
+   resource "kubernetes_secret" "wayofthesys-tls-loadtesting" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "tls"

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-org-tls"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id-loadtesting will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key-id-loadtesting" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-eab-hmac-key-id"
+           namespace        = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-loadtesting will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key-loadtesting" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-eab-hmac-key"
+           namespace        = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.loadtesting_manager will be created
+   resource "kubernetes_service_account" "loadtesting_manager" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       secret {
+           name = "loadtesting-manager"
        }
    }

Plan: 16 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
